# St7SetHRACaseCombinationFactor

Sets the result factor for an Applied Load case in harmonic time results.

long St7SetHRACaseCombinationFactor(long uID, long CaseNum, double Factor)

Input Parameters

uID

Strand7 model file ID.

CaseNum

Case number.

Factor

Factor value.